dnikolov/flipper-esp32-over-ble/heltec/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_MBEDTLS_HKDF_C=y

# docs/PLAN.md Phase 4 wardriving port (2026-09-23): the stock/default partition table (sized
# for a small factory app, no dedicated data partition) left BL13's near-full factory app with
# no room for wardriving_log.c's dedicated raw-flash circular log. Custom table sized for this
# board's actual 8MB flash -- see heltec/partitions.csv's own comments for the byte accounting.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# docs/PLAN.md Phase 4 gps port (2026-09-23): adding esp_driver_uart (location.c/
# nmea_parser.c) pushed classic ESP32's small iram0_0_seg region over budget by ~750 bytes.
# This moves selected non-ISR FreeRTOS functions from IRAM to flash (Espressif's documented
# fix for this exact overflow class on classic ESP32) -- none of this firmware's ISR-context
# code (BLE/NimBLE controller callbacks, the GPIO factory-reset ISR) depends on the
# functions this option relocates, only ordinary task-context FreeRTOS API calls do.
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
